package mxnder.desertmod.npc;

import java.util.Arrays;
import java.util.List;

// Диалоги простого NPC (список фраз)
public final class SimpleNpcDialog extends BaseNpcDialog {

    // Фразы для случайного выбора (изменить текст)
    private static final List<String> SIMPLE_NPC_PHRASES = Arrays.asList(
            "Пески шепчут что-то неладное",
            "Фараон строит новую пирамиду",
            "Редко здесь бывают чужаки",
            "Бывал ли ты в Сиве?",
            "Нужно помолиться в храме",
            "Да простит меня Амон-Ра",
            "Не поверишь, но я видел жемчуг",
            "Засуха опустилась на наши земли",
            "Иду молиться Исиде за семью",
            "У меня родился сын - Саамон",
            "Жрецы обещают разлив Нила",
            "Нил всё ещё не у красной отметки",
            "Как бы хватило еды на этот год",
            "Амон-Ра видит все наши деяния",
            "Что привело тебя сюда, странник?",
            "Не видел тебя здесь раньше",
            "Ты не видел моего осла?",
            "Сейчас даже песок обжигает",
            "Если ты привёз лён, иди на рынок",
            "Хапи разгневан - воды мало",
            "Мой прадед строил пирамиду",
            "Остерегайся песков после заката",
            "Солнце безжалостно ко всем",
            "Пески более жестоки, чем кажется",
            "Что ищешь здесь, незнакомец?",
            "День выдался тяжёлым",
            "Надо успеть все дела до заката",
            "Пески не любят беспечных"
    );

    public SimpleNpcDialog() {
        super(SIMPLE_NPC_PHRASES);
    }
}
